// Напишите программу, которая на вход принимает число и выдает его квадрат (число умноженное само на себя)

// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

// Console.Write("Введите число: ");
// string number = Console.ReadLine();
// int result = int.Parse(number);
// Console.WriteLine(result * result);

Console.Write("Введите число: ");
int number = Convert.ToInt32(Console.ReadLine());
Console.WriteLine(number * number);